twigpwr/battery-odometer-alpha/development/alpha-software/battery_odometer_alpha/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLEDsPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t CAN0_STB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA16 (pin 4)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_CAN0_STB_GPIO, BOARD_INITLEDSPINS_CAN0_STB_PIN, &CAN0_STB_config);

    gpio_pin_config_t VDD_5V_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 16)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_VDD_5V_EN_GPIO, BOARD_INITLEDSPINS_VDD_5V_EN_PIN, &VDD_5V_EN_config);

    gpio_pin_config_t TP2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 41)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_TP2_GPIO, BOARD_INITLEDSPINS_TP2_PIN, &TP2_config);

    gpio_pin_config_t TP3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC6 (pin 42)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_TP3_GPIO, BOARD_INITLEDSPINS_TP3_PIN, &TP3_config);

    gpio_pin_config_t TP1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 43)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_TP1_GPIO, BOARD_INITLEDSPINS_TP1_PIN, &TP1_config);

    /* PORTA16 (pin 4) is configured as PTA16 */
    PORT_SetPinMux(BOARD_INITLEDSPINS_CAN0_STB_PORT, BOARD_INITLEDSPINS_CAN0_STB_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 16) is configured as PTB0 */
    PORT_SetPinMux(BOARD_INITLEDSPINS_VDD_5V_EN_PORT, BOARD_INITLEDSPINS_VDD_5V_EN_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 41) is configured as PTC5 */
    PORT_SetPinMux(BOARD_INITLEDSPINS_TP2_PORT, BOARD_INITLEDSPINS_TP2_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 42) is configured as PTC6 */
    PORT_SetPinMux(BOARD_INITLEDSPINS_TP3_PORT, BOARD_INITLEDSPINS_TP3_PIN, kPORT_MuxAsGpio);

    /* PORTC7 (pin 43) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITLEDSPINS_TP1_PORT, BOARD_INITLEDSPINS_TP1_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '37', peripheral: GPIOC, signal: 'GPIO, 1', pin_signal: PTC1/RF_EARLY_WARNING/ANT_B/I2C0_SDA/LPUART0_RTS_b/TPM0_CH2/SPI1_SCK, identifier: SPI1_CLK,
    direction: INPUT}
  - {pin_num: '38', peripheral: GPIOC, signal: 'GPIO, 2', pin_signal: PTC2/LLWU_P10/TX_SWITCH/I2C1_SCL/LPUART0_RX/CMT_IRO/DTM_RX/SPI1_SOUT, identifier: SPI1_MOSI,
    direction: INPUT}
  - {pin_num: '39', peripheral: GPIOC, signal: 'GPIO, 3', pin_signal: PTC3/LLWU_P11/RX_SWITCH/I2C1_SDA/LPUART0_TX/TPM0_CH1/DTM_TX/SPI1_SIN/CAN0_TX, direction: INPUT}
  - {pin_num: '40', peripheral: GPIOC, signal: 'GPIO, 4', pin_signal: PTC4/LLWU_P12/RF_ACTIVE/ANT_A/EXTRG_IN/LPUART0_CTS_b/TPM1_CH0/I2C0_SCL/SPI1_PCS0/CAN0_RX, direction: INPUT}
  - {pin_num: '45', peripheral: GPIOC, signal: 'GPIO, 16', pin_signal: PTC16/LLWU_P0/RF_STATUS/SPI0_SCK/I2C0_SDA/LPUART0_RTS_b/TPM0_CH3/LPUART1_RTS_b, direction: INPUT}
  - {pin_num: '46', peripheral: GPIOC, signal: 'GPIO, 17', pin_signal: PTC17/LLWU_P1/RF_EXT_OSC_EN/SPI0_SOUT/I2C1_SCL/LPUART0_RX/DTM_RX/LPUART1_RX, direction: INPUT}
  - {pin_num: '47', peripheral: GPIOC, signal: 'GPIO, 18', pin_signal: PTC18/LLWU_P2/SPI0_SIN/I2C1_SDA/LPUART0_TX/DTM_TX/LPUART1_TX, direction: INPUT, pull_enable: disable,
    passive_filter: disable}
  - {pin_num: '48', peripheral: GPIOC, signal: 'GPIO, 19', pin_signal: PTC19/LLWU_P3/RF_EARLY_WARNING/SPI0_PCS0/I2C0_SCL/LPUART0_CTS_b/LPUART1_CTS_b, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPIPins(void)
{
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t SPI1_CLK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 37)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SPI1_CLK_GPIO, BOARD_INITSPIPINS_SPI1_CLK_PIN, &SPI1_CLK_config);

    gpio_pin_config_t SPI1_MOSI_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 38)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SPI1_MOSI_GPIO, BOARD_INITSPIPINS_SPI1_MOSI_PIN, &SPI1_MOSI_config);

    gpio_pin_config_t SPI1_MISO_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 39)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SPI1_MISO_GPIO, BOARD_INITSPIPINS_SPI1_MISO_PIN, &SPI1_MISO_config);

    gpio_pin_config_t SPI1_CS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 40)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SPI1_CS_GPIO, BOARD_INITSPIPINS_SPI1_CS_PIN, &SPI1_CS_config);

    gpio_pin_config_t SPI0_CLK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC16 (pin 45)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SPI0_CLK_GPIO, BOARD_INITSPIPINS_SPI0_CLK_PIN, &SPI0_CLK_config);

