twigpwr/battery-odometer-alpha/development/alpha-software/battery_odometer_alpha/board/pin_mux.c
    gpio_pin_config_t SPI0_MOSI_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC17 (pin 46)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SPI0_MOSI_GPIO, BOARD_INITSPIPINS_SPI0_MOSI_PIN, &SPI0_MOSI_config);

    gpio_pin_config_t SPI0_MISO_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC18 (pin 47)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SPI0_MISO_GPIO, BOARD_INITSPIPINS_SPI0_MISO_PIN, &SPI0_MISO_config);

    gpio_pin_config_t SPI0_CS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC19 (pin 48)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SPI0_CS_GPIO, BOARD_INITSPIPINS_SPI0_CS_PIN, &SPI0_CS_config);

    /* PORTC1 (pin 37) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SPI1_CLK_PORT, BOARD_INITSPIPINS_SPI1_CLK_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 45) is configured as PTC16 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SPI0_CLK_PORT, BOARD_INITSPIPINS_SPI0_CLK_PIN, kPORT_MuxAsGpio);

    /* PORTC17 (pin 46) is configured as PTC17 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SPI0_MOSI_PORT, BOARD_INITSPIPINS_SPI0_MOSI_PIN, kPORT_MuxAsGpio);

    /* PORTC18 (pin 47) is configured as PTC18 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SPI0_MISO_PORT, BOARD_INITSPIPINS_SPI0_MISO_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[18] = ((PORTC->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pull resistor is not enabled on the corresponding pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTC19 (pin 48) is configured as PTC19 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SPI0_CS_PORT, BOARD_INITSPIPINS_SPI0_CS_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 38) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SPI1_MOSI_PORT, BOARD_INITSPIPINS_SPI1_MOSI_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 39) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SPI1_MISO_PORT, BOARD_INITSPIPINS_SPI1_MISO_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 40) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SPI1_CS_PORT, BOARD_INITSPIPINS_SPI1_CS_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCANPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '5', peripheral: CAN0, signal: TX, pin_signal: PTA17/LLWU_P5/SPI1_SIN/LPUART1_RX/CAN0_TX/TPM_CLKIN1, identifier: '', pull_select: down, pull_enable: disable}
  - {pin_num: '6', peripheral: CAN0, signal: RX, pin_signal: PTA18/LLWU_P6/SPI1_SCK/LPUART1_TX/CAN0_RX/TPM2_CH0, identifier: '', pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCANPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCANPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA17 (pin 5) is configured as CAN0_TX */
    PORT_SetPinMux(PORTA, 17U, kPORT_MuxAlt4);

    PORTA->PCR[17] = ((PORTA->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullDown)

                      /* Pull Enable: Internal pull resistor is not enabled on the corresponding pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA18 (pin 6) is configured as CAN0_RX */
    PORT_SetPinMux(PORTA, 18U, kPORT_MuxAlt4);

    PORTA->PCR[18] = ((PORTA->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADCPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '7', peripheral: GPIOA, signal: 'GPIO, 19', pin_signal: ADC0_SE5/PTA19/LLWU_P7/SPI1_PCS0/LPUART1_CTS_b/TPM2_CH1, direction: INPUT}
  - {pin_num: '18', peripheral: GPIOB, signal: 'GPIO, 2', pin_signal: ADC0_SE3/CMP0_IN3/PTB2/RF_NOT_ALLOWED/LLWU_P9/DTM_TX/TPM0_CH0/TPM1_CH0/TPM2_CH0, identifier: BATT_T2,
    direction: INPUT}
  - {pin_num: '19', peripheral: GPIOB, signal: 'GPIO, 3', pin_signal: ADC0_SE2/CMP0_IN4/PTB3/ERCLK32K/RF_ACTIVE/LPUART1_RTS_b/TPM0_CH1/CLKOUT/TPM1_CH1/RTC_CLKOUT/TPM2_CH1,
    identifier: BATT_T1, direction: INPUT}
  - {pin_num: '17', peripheral: GPIOB, signal: 'GPIO, 1', pin_signal: ADC0_SE1/CMP0_IN5/PTB1/RF_PRIORITY/DTM_RX/I2C0_SDA/LPTMR0_ALT1/TPM0_CH2/CMT_IRO/CAN0_RX, direction: INPUT}
  - {pin_num: '23', peripheral: GPIOB, signal: 'GPIO, 18', pin_signal: ADC0_SE4/CMP0_IN2/PTB18/LPUART1_CTS_b/I2C1_SCL/TPM_CLKIN0/TPM0_CH0/NMI_b, identifier: PCB_T3,
    direction: INPUT, pull_enable: disable, passive_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADCPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t BATT_V_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA19 (pin 7)  */
    GPIO_PinInit(BOARD_INITADCPINS_BATT_V_GPIO, BOARD_INITADCPINS_BATT_V_PIN, &BATT_V_config);

    gpio_pin_config_t BATT_I_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 17)  */
    GPIO_PinInit(BOARD_INITADCPINS_BATT_I_GPIO, BOARD_INITADCPINS_BATT_I_PIN, &BATT_I_config);

    gpio_pin_config_t BATT_T2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 18)  */
    GPIO_PinInit(BOARD_INITADCPINS_BATT_T2_GPIO, BOARD_INITADCPINS_BATT_T2_PIN, &BATT_T2_config);

    gpio_pin_config_t BATT_T1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 19)  */
    GPIO_PinInit(BOARD_INITADCPINS_BATT_T1_GPIO, BOARD_INITADCPINS_BATT_T1_PIN, &BATT_T1_config);

    gpio_pin_config_t PCB_T3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 23)  */
    GPIO_PinInit(BOARD_INITADCPINS_PCB_T3_GPIO, BOARD_INITADCPINS_PCB_T3_PIN, &PCB_T3_config);

    /* PORTA19 (pin 7) is configured as PTA19 */
    PORT_SetPinMux(BOARD_INITADCPINS_BATT_V_PORT, BOARD_INITADCPINS_BATT_V_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 17) is configured as PTB1 */
    PORT_SetPinMux(BOARD_INITADCPINS_BATT_I_PORT, BOARD_INITADCPINS_BATT_I_PIN, kPORT_MuxAsGpio);

    /* PORTB18 (pin 23) is configured as PTB18 */
    PORT_SetPinMux(BOARD_INITADCPINS_PCB_T3_PORT, BOARD_INITADCPINS_PCB_T3_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[18] = ((PORTB->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pull resistor is not enabled on the corresponding pin. */
                      | PORT_PCR_PE(kPORT_PullDisable)

                      /* Passive Filter Enable: Passive input filter is disabled on the corresponding pin. */
                      | PORT_PCR_PFE(kPORT_PassiveFilterDisable));

    /* PORTB2 (pin 18) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITADCPINS_BATT_T2_PORT, BOARD_INITADCPINS_BATT_T2_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 19) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITADCPINS_BATT_T1_PORT, BOARD_INITADCPINS_BATT_T1_PIN, kPORT_MuxAsGpio);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
